app/controllers/clients_controller.rb

  def index
  @client = Client.all
---
SELECT "clients".* FROM "clients"