app/controllers/detailproducts_controller.rb

  def index
  @detailproducts = Detailproduct.all
---
SELECT "detailproducts".* FROM "detailproducts"