app/controllers/detailservices_controller.rb

SELECT "detailservices".* FROM "detailservices"
---
  def index
  @detailservices = Detailservice.all