app/controllers/employees_controller.rb

INSERT INTO "employees" ("id_employee", "name", "salary", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id_employee", 123], ["name", "giovani"], ["salary", 200.54], ["phone", 1234], ["created_at", "2015-09-30 04:25:56.144090"], ["updated_at", "2015-09-30 04:25:56.144090"]]
---
  def create
  	@employee = Employee.new(employee_params)

    if @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "employees" SET "name" = ?, "salary" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "juan pablo"], ["salary", 30000.0], ["updated_at", "2015-10-01 23:18:08.960396"], ["id", 1]]
---
def update
  @employee = Employee.find(params[:id])

  if @employee.update(employee_params)